<template>
  <div class="service_page">
    <div class="service_page_title">{{ serviceInfo.title }}</div>
    <div class="service_page_content">
        <div class="list" v-for="item in serviceInfo.list" :key="item.label">
            <p class="label">{{ item.label }}</p>
            <div class="intro" v-html="item.intro"></div>
        </div>
    </div>
  </div>
</template>

<script>
export default {
    data() {
        return {
            serviceInfo: {
                title: '专属服务',
                list: [
                    {label: '配送标准', intro: '<p>所有中国大陆订单均由圆通进行配送，并且您可享受免费标准配送服务。我们在您下单后1-3个工作日内将商品送达您的地址。工作日指周一至周五（中国公共节假日除外）。</p><p>您可以在线查询订单配送进度。我们将在商品离开仓库后立即发送短信至您的手机，向您确认商品已发货。</p><p>为安全起见，所有订单均需本人签收。若快递员无法在三天之内与您取得联系，您的订单将被退回GODSFORGE仓库，并按照退货流程处理。</p>'},
                    {label: '配送区域及国际运输', intro: '<p>GODSFORGE中国大陆官方网站www.godsforge.cn/的订单仅在中国大陆（不包括中国香港、中国澳门和中国台湾）进行配送。如需配送至中国大陆以外的地区或其他国际目的地，请联系我们官方网站客服。</p>'},
                    {label: '到店取货', intro: '<p>我们目前无法将您的订单配送至您选择的GODSFORGE门店，未来将推出这一服务。</p>'},
                    {label: '特殊商品预定', intro: '<p>如您预定了某件商品，我们将在商品到货后立即发货。如需查询订单的预计发货日期，请联系客服。</p>'},
                    {label: '香水', intro: '<p>请注意，由于受到运输限制，香水属于不可退货的商品。由于香水属于易燃物品，因此无法空运，我们只能采用陆运配送</p>'},
                    {label: '退货', intro: '<p>若您的订单符合退货政策，收到商品后，您有7天时间来考虑并告知我们您是否有意退货。您可以在7天内按照下述流程退还商品。按照各国具体法律法规的规定，退货期限可能有所不同。在申请退货前，请确保相关商品符合我们的退货条件。</p>'},
                    {label: '退货方式', intro: '<p>您可在收到商品后7天内提出退货。请注意，定制商品和香水属于不可退货的商品。唇膏商品如需退货，请保持商品未开封未使用，原包装完好。</p><p>请按照以下流程完成退货：</p><p>1. 请联系客服，告知我们您需要退货。客服将询问您的电话号码和订单号以配合完成您的申请。<br/>2. 我方的客服团队将免费代您联系一家快递公司，并安排其在您方便的时间上门取货。<br/>3. 请完整填写原始订单包裹中随附的退货信息表，并确保退货商品的所有包装、配件及任何吊牌（如适用）均完好无缺。礼盒也属于商品的一部分，因此所有女包均须放置在其原始完好的礼盒中退还。<br/>4. 请用您包裹的原始包装进行打包，并将原始包裹中附有的退货标签粘贴在包装盒外部。若您由于某种原因遗失了退货标签，请联系客服获取进一步协助。<br/>5. 我方将在收到您退还的商品后立即按照我们的退货政策对该商品进行全面检查。若商品符合退货政策，您将立即收到一条确认退货和退款的短信。<br/>我们争取在收到商品后的48小时内处理所有退货。在促销期间，请允许我们在最长5个自然日内处理退货。</p>'},
                    {label: '退货条件', intro: '<p>申请退货前，请确保商品符合我们的退货条件：</p><p>1. 所有退还的GODSFORGE商品必须处于没有印记且未经使用的状态，并且使用原始包装（包括防尘袋、和保证卡）。印有品牌标识的礼盒也属于商品的一部分，因此也应当使用原本提供的运输保护盒进行退还。<br/>2. 请确保在收到商品后7天内提出退货申请。随后您将再获得7天时间按照上述流程将商品退还至我方。<br/>3. 仅适用于在GODSFORGE中国大陆官方网站购买的商品。<br/>不符合上述要求的商品无法退货，我们将把商品退回至原始订单中使用的配送地址。</p>'},
                    {label: '重要信息', intro: '<p>为确保您的退货能快速处理，请您尽可能将同一订单中希望退货的所有商品以同一个包裹发出。</p><p>所有退货商品必须处于未经标记或使用的状态，并使用原始包装（包括防尘袋、和保证卡）。此外，礼盒也属于包类商品的一部分，因此在退货时应将女包应置于其原始完好的礼盒中。</p><p>不要把皮件放置在阳光下长时间地照射或是在高温度的环境中。若女包未与礼盒一同退回、包面有印记或配件（如肩带）缺失，我们将拒绝受理退货，并将其退还至原始订单的配送地址。对于经过外部维修服务维修或变更的任何商品，我们将不予退货。</p>'},
                    {label: '退款', intro: '<p>按照退货政策退货的所有商品的价款（含销售税）将被退还至原购买人的账户。</p><p>请注意，退款可能需经过最长10个工作日到达您的账户中（取决于您的支付类型）。工作日指周一至周五（中国公共节假日除外）。</p>'},
                    {label: '瑕疵商品', intro: '<p>按照退货政策退货的所有商品的价款（含销售税）将被退还至原购买人的账户。</p><p>请注意，退款可能需经过最长10个工作日到达您的账户中（取决于您的支付类型）。工作日指周一至周五（中国公共节假日除外）。</p>'},
                ],
            }
        }
    }
}
</script>

<style lang="scss" scoped>
.service_page {

    &_title {
        background-color: #fff;
        position: fixed;
        top: 80px;
        width: 100%;
        height: 50px;
        line-height: 50px;
        box-sizing: border-box;
        font-size: 16px;
        font-weight: 600;
        color: #25211E;
        text-align: center;
    }

    &_content {
        margin-top: 130px;
        padding: 0 30px;
        overflow: hidden;

        .list {
            margin: 30px 0;

            .label {
                font-size: 14px;
                font-weight: 600;
                color: #434343;
            }
        }

        /deep/p {
            margin: 20px 0;
            font-size: 12px;
            font-weight: 400;
            line-height: 20px;
            color: #434343;
        }
    }
}
</style>